### dev01 - Terraform Plan
#### Terraform Initialization success
#### Terraform Validation success
#### Terraform Format and Style success
#### Terraform Plan success

<details><summary>dev01 - Plan</summary>

terraform
Acquiring state lock. This may take a few moments...
module.mod1.aws_ssm_parameter.favourite: Refreshing state... [id=food]
module.mod2.aws_ssm_parameter.favourite: Refreshing state... [id=colour]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.mod1.aws_ssm_parameter.favourite must be replaced
-/+ resource "aws_ssm_parameter" "favourite" {
      ~ arn            = "arn:aws:ssm:eu-west-2:680805529666:parameter/food" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "food" -> (known after apply)
      + insecure_value = (known after apply)
      ~ name           = "food" -> "/tftest/dev01/food" # forces replacement
      - overwrite      = false -> null
      ~ tags           = {
          ~ "Name" = "food" -> "/tftest/dev01/food"
        }
      ~ tags_all       = {
          ~ "Name"             = "food" -> "/tftest/dev01/food"
            # (11 unchanged elements hidden)
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 19 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.mod2.aws_ssm_parameter.favourite must be replaced
-/+ resource "aws_ssm_parameter" "favourite" {
      ~ arn            = "arn:aws:ssm:eu-west-2:680805529666:parameter/colour" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "colour" -> (known after apply)
      + insecure_value = (known after apply)
      ~ name           = "colour" -> "/tftest/dev01/colour" # forces replacement
      - overwrite      = false -> null
      ~ tags           = {
          ~ "Name" = "colour" -> "/tftest/dev01/colour"
        }
      ~ tags_all       = {
          ~ "Name"             = "colour" -> "/tftest/dev01/colour"
            # (11 unchanged elements hidden)
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 19 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...



</details>

* Triggered by: @AntonyPotter, Action: pull_request